GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f24q10.inc
_EBTR1_ON_6L         EQU  H'FD'; Block 1 (002000-003FFFh) protected from table reads executed in other blocks
_EBTR1_OFF_6L        EQU  H'FF'; Block 1 (002000-003FFFh) not protected from table reads executed in other blocks

;----- CONFIG6H Options --------------------------------------------------
_EBTRB_ON_6H         EQU  H'FD'; Boot Block (000000-0007FFh) protected from table reads executed in other blocks
_EBTRB_OFF_6H        EQU  H'FF'; Boot Block (000000-0007FFh) not protected from table reads executed in other blocks


;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'200000'
_IDLOC1          EQU  H'200001'
_IDLOC2          EQU  H'200002'
_IDLOC3          EQU  H'200003'
_IDLOC4          EQU  H'200004'
_IDLOC5          EQU  H'200005'
_IDLOC6          EQU  H'200006'
_IDLOC7          EQU  H'200007'
_IDLOC8          EQU  H'200008'
_IDLOC9          EQU  H'200009'
_IDLOC10         EQU  H'20000A'
_IDLOC11         EQU  H'20000B'
_IDLOC12         EQU  H'20000C'
_IDLOC13         EQU  H'20000D'
_IDLOC14         EQU  H'20000E'
_IDLOC15         EQU  H'20000F'
_IDLOC16         EQU  H'200010'
_IDLOC17         EQU  H'200011'
_IDLOC18         EQU  H'200012'
_IDLOC19         EQU  H'200013'
_IDLOC20         EQU  H'200014'
_IDLOC21         EQU  H'200015'
_IDLOC22         EQU  H'200016'
_IDLOC23         EQU  H'200017'
_IDLOC24         EQU  H'200018'
_IDLOC25         EQU  H'200019'
_IDLOC26         EQU  H'20001A'
_IDLOC27         EQU  H'20001B'
_IDLOC28         EQU  H'20001C'
_IDLOC29         EQU  H'20001D'
_IDLOC30         EQU  H'20001E'
_IDLOC31         EQU  H'20001F'
_IDLOC32         EQU  H'200020'
_IDLOC33         EQU  H'200021'
_IDLOC34         EQU  H'200022'
_IDLOC35         EQU  H'200023'
_IDLOC36         EQU  H'200024'
_IDLOC37         EQU  H'200025'
_IDLOC38         EQU  H'200026'
_IDLOC39         EQU  H'200027'
_IDLOC40         EQU  H'200028'
_IDLOC41         EQU  H'200029'
_IDLOC42         EQU  H'20002A'
_IDLOC43         EQU  H'20002B'
_IDLOC44         EQU  H'20002C'
_IDLOC45         EQU  H'20002D'
_IDLOC46         EQU  H'20002E'
_IDLOC47         EQU  H'20002F'
_IDLOC48         EQU  H'200030'
_IDLOC49         EQU  H'200031'
_IDLOC50         EQU  H'200032'
_IDLOC51         EQU  H'200033'
_IDLOC52         EQU  H'200034'
_IDLOC53         EQU  H'200035'
_IDLOC54         EQU  H'200036'
_IDLOC55         EQU  H'200037'
_IDLOC56         EQU  H'200038'
_IDLOC57         EQU  H'200039'
_IDLOC58         EQU  H'20003A'
_IDLOC59         EQU  H'20003B'
_IDLOC60         EQU  H'20003C'
_IDLOC61         EQU  H'20003D'
_IDLOC62         EQU  H'20003E'
_IDLOC63         EQU  H'20003F'
_IDLOC64         EQU  H'200040'
_IDLOC65         EQU  H'200041'
_IDLOC66         EQU  H'200042'
_IDLOC67         EQU  H'200043'
_IDLOC68         EQU  H'200044'
_IDLOC69         EQU  H'200045'
_IDLOC70         EQU  H'200046'
_IDLOC71         EQU  H'200047'
_IDLOC72         EQU  H'200048'
_IDLOC73         EQU  H'200049'
_IDLOC74         EQU  H'20004A'
_IDLOC75         EQU  H'20004B'
_IDLOC76         EQU  H'20004C'
_IDLOC77         EQU  H'20004D'
_IDLOC78         EQU  H'20004E'
_IDLOC79         EQU  H'20004F'
_IDLOC80         EQU  H'200050'
_IDLOC81         EQU  H'200051'
_IDLOC82         EQU  H'200052'
_IDLOC83         EQU  H'200053'
_IDLOC84         EQU  H'200054'
_IDLOC85         EQU  H'200055'
_IDLOC86         EQU  H'200056'
_IDLOC87         EQU  H'200057'
_IDLOC88         EQU  H'200058'
_IDLOC89         EQU  H'200059'
_IDLOC90         EQU  H'20005A'
_IDLOC91         EQU  H'20005B'
_IDLOC92         EQU  H'20005C'
_IDLOC93         EQU  H'20005D'
_IDLOC94         EQU  H'20005E'
_IDLOC95         EQU  H'20005F'
_IDLOC96         EQU  H'200060'
_IDLOC97         EQU  H'200061'
_IDLOC98         EQU  H'200062'
_IDLOC99         EQU  H'200063'
_IDLOC100        EQU  H'200064'
_IDLOC101        EQU  H'200065'
_IDLOC102        EQU  H'200066'
_IDLOC103        EQU  H'200067'
_IDLOC104        EQU  H'200068'
_IDLOC105        EQU  H'200069'
_IDLOC106        EQU  H'20006A'
_IDLOC107        EQU  H'20006B'
_IDLOC108        EQU  H'20006C'
_IDLOC109        EQU  H'20006D'
_IDLOC110        EQU  H'20006E'
_IDLOC111        EQU  H'20006F'
_IDLOC112        EQU  H'200070'
_IDLOC113        EQU  H'200071'
_IDLOC114        EQU  H'200072'
_IDLOC115        EQU  H'200073'
_IDLOC116        EQU  H'200074'
_IDLOC117        EQU  H'200075'
_IDLOC118        EQU  H'200076'
_IDLOC119        EQU  H'200077'
_IDLOC120        EQU  H'200078'
_IDLOC121        EQU  H'200079'
_IDLOC122        EQU  H'20007A'
_IDLOC123        EQU  H'20007B'
_IDLOC124        EQU  H'20007C'
_IDLOC125        EQU  H'20007D'
_IDLOC126        EQU  H'20007E'
_IDLOC127        EQU  H'20007F'
_IDLOC128        EQU  H'200080'
_IDLOC129        EQU  H'200081'
_IDLOC130        EQU  H'200082'
_IDLOC131        EQU  H'200083'
_IDLOC132        EQU  H'200084'
_IDLOC133        EQU  H'200085'
_IDLOC134        EQU  H'200086'
_IDLOC135        EQU  H'200087'
_IDLOC136        EQU  H'200088'
_IDLOC137        EQU  H'200089'
_IDLOC138        EQU  H'20008A'
_IDLOC139        EQU  H'20008B'
_IDLOC140        EQU  H'20008C'
_IDLOC141        EQU  H'20008D'
_IDLOC142        EQU  H'20008E'
_IDLOC143        EQU  H'20008F'
_IDLOC144        EQU  H'200090'
_IDLOC145        EQU  H'200091'
_IDLOC146        EQU  H'200092'
_IDLOC147        EQU  H'200093'
_IDLOC148        EQU  H'200094'
_IDLOC149        EQU  H'200095'
_IDLOC150        EQU  H'200096'
_IDLOC151        EQU  H'200097'
_IDLOC152        EQU  H'200098'
_IDLOC153        EQU  H'200099'
_IDLOC154        EQU  H'20009A'
_IDLOC155        EQU  H'20009B'
_IDLOC156        EQU  H'20009C'
_IDLOC157        EQU  H'20009D'
_IDLOC158        EQU  H'20009E'
_IDLOC159        EQU  H'20009F'
_IDLOC160        EQU  H'2000A0'
_IDLOC161        EQU  H'2000A1'
_IDLOC162        EQU  H'2000A2'
_IDLOC163        EQU  H'2000A3'
_IDLOC164        EQU  H'2000A4'
_IDLOC165        EQU  H'2000A5'
_IDLOC166        EQU  H'2000A6'
_IDLOC167        EQU  H'2000A7'
_IDLOC168        EQU  H'2000A8'
_IDLOC169        EQU  H'2000A9'
_IDLOC170        EQU  H'2000AA'
_IDLOC171        EQU  H'2000AB'
_IDLOC172        EQU  H'2000AC'
_IDLOC173        EQU  H'2000AD'
_IDLOC174        EQU  H'2000AE'
_IDLOC175        EQU  H'2000AF'
_IDLOC176        EQU  H'2000B0'
_IDLOC177        EQU  H'2000B1'
_IDLOC178        EQU  H'2000B2'
_IDLOC179        EQU  H'2000B3'
_IDLOC180        EQU  H'2000B4'
_IDLOC181        EQU  H'2000B5'
_IDLOC182        EQU  H'2000B6'
_IDLOC183        EQU  H'2000B7'
_IDLOC184        EQU  H'2000B8'
_IDLOC185        EQU  H'2000B9'
_IDLOC186        EQU  H'2000BA'
_IDLOC187        EQU  H'2000BB'
_IDLOC188        EQU  H'2000BC'
_IDLOC189        EQU  H'2000BD'
_IDLOC190        EQU  H'2000BE'
_IDLOC191        EQU  H'2000BF'
_IDLOC192        EQU  H'2000C0'
_IDLOC193        EQU  H'2000C1'
_IDLOC194        EQU  H'2000C2'
_IDLOC195        EQU  H'2000C3'
_IDLOC196        EQU  H'2000C4'
_IDLOC197        EQU  H'2000C5'
_IDLOC198        EQU  H'2000C6'
_IDLOC199        EQU  H'2000C7'
_IDLOC200        EQU  H'2000C8'
_IDLOC201        EQU  H'2000C9'
_IDLOC202        EQU  H'2000CA'
_IDLOC203        EQU  H'2000CB'
_IDLOC204        EQU  H'2000CC'
_IDLOC205        EQU  H'2000CD'
_IDLOC206        EQU  H'2000CE'
_IDLOC207        EQU  H'2000CF'
_IDLOC208        EQU  H'2000D0'
_IDLOC209        EQU  H'2000D1'
_IDLOC210        EQU  H'2000D2'
_IDLOC211        EQU  H'2000D3'
_IDLOC212        EQU  H'2000D4'
_IDLOC213        EQU  H'2000D5'
_IDLOC214        EQU  H'2000D6'
_IDLOC215        EQU  H'2000D7'
_IDLOC216        EQU  H'2000D8'
_IDLOC217        EQU  H'2000D9'
_IDLOC218        EQU  H'2000DA'
_IDLOC219        EQU  H'2000DB'
_IDLOC220        EQU  H'2000DC'
_IDLOC221        EQU  H'2000DD'
_IDLOC222        EQU  H'2000DE'
_IDLOC223        EQU  H'2000DF'
_IDLOC224        EQU  H'2000E0'
_IDLOC225        EQU  H'2000E1'
_IDLOC226        EQU  H'2000E2'
_IDLOC227        EQU  H'2000E3'
_IDLOC228        EQU  H'2000E4'
_IDLOC229        EQU  H'2000E5'
_IDLOC230        EQU  H'2000E6'
_IDLOC231        EQU  H'2000E7'
_IDLOC232        EQU  H'2000E8'
_IDLOC233        EQU  H'2000E9'
_IDLOC234        EQU  H'2000EA'
_IDLOC235        EQU  H'2000EB'
_IDLOC236        EQU  H'2000EC'
_IDLOC237        EQU  H'2000ED'
_IDLOC238        EQU  H'2000EE'
_IDLOC239        EQU  H'2000EF'
_IDLOC240        EQU  H'2000F0'
_IDLOC241        EQU  H'2000F1'
_IDLOC242        EQU  H'2000F2'
_IDLOC243        EQU  H'2000F3'
_IDLOC244        EQU  H'2000F4'
_IDLOC245        EQU  H'2000F5'
_IDLOC246        EQU  H'2000F6'
_IDLOC247        EQU  H'2000F7'
_IDLOC248        EQU  H'2000F8'
_IDLOC249        EQU  H'2000F9'
_IDLOC250        EQU  H'2000FA'
_IDLOC251        EQU  H'2000FB'
_IDLOC252        EQU  H'2000FC'
_IDLOC253        EQU  H'2000FD'
_IDLOC254        EQU  H'2000FE'
_IDLOC255        EQU  H'2000FF'

        LIST
